Tekla Open API Reference for Tekla Structures 2025
CastUnitDrawing Constructor (Identifier, CastUnitDrawing.CastUnitDrawingCreationType, String)
 Instantiates a new cast unit drawing with given attributes for a given cast unit.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public CastUnitDrawing(
	Identifier castUnitIdentifier,
	CastUnitDrawing.CastUnitDrawingCreationType castUnitDrawingCreationType,
	string AttributeFile
)
Public Sub New (
	castUnitIdentifier As Identifier,
	castUnitDrawingCreationType As CastUnitDrawing.CastUnitDrawingCreationType,
	AttributeFile As String
)
Parameters
castUnitIdentifier
Type: Tekla.Structures.Identifier
The identifier of the model object cast unit.
castUnitDrawingCreationType
Type: Tekla.Structures.Drawing.CastUnitDrawing.CastUnitDrawingCreationType
Specifies the cast unit drawing creation type (by cast unit id or by cast unit position).
AttributeFile
Type: System.String
The filename of the attributes file.
See Also
Reference
CastUnitDrawing Class
CastUnitDrawing Overload
Tekla.Structures.Drawing Namespace